/* Chapter 1. Lesson 1. Почему TypeScript?;

1. Проблемы JavaScript
1.1. Отсутсвтие Type Safety
1.2. Динамические типы(не строгая типизация)
1.3. Autocomplete
1.4. Невозможность рефакторинга
1.5. Невозможно понять структуру данных

2. О TypeScript
2.1. Open source
2.2. Разрабатывается/ основан компанией Microsoft
*/

/* Chapter 1. Lesson 3. Как устроен курс?;
1. 16 модулей и 7 частей.
1.1. Введение и настройка окружения
1.2. Основные типы, продвинутые типы, Классы, Компилятор TypeScript
1.3. Generics, Манипуляция с типами, Служебные типы, Декораторы.
1.4. Модульность и библиотеки, Порождаюшие паттерны, Структурные паттерны
1.5. Поведенчиские паттерны
1.6. Проект - утилита выполнения команд
*/